---
kind: enumMember
id: F:Autodesk.Revit.DB.ExportRange.CurrentView
enum: Autodesk.Revit.DB.ExportRange
source: html/a0e98f2d-3da3-c6bb-a27e-7460f7293781.htm
---
# Autodesk.Revit.DB.ExportRange.CurrentView

Export the current view only (zoom to fit of the current view).